In [16]:
#LINK - Pandas/D1-1-loading-data-from-file.ipynb
import pandas as pd

In [17]:
bios = pd.read_csv("complete-pandas-tutorial/data/bios.csv")

# Filtering Data

In [ ]:
# bios.loc[200:1000]
# bios.head()
# bios.info()
# bios.loc[bios["height_cm"] > 215, ["name", "height_cm"]]
# bios[bios["height_cm"] > 215] #same thing we achieve
# bios[bios["height_cm"] > 215][["name", "height_cm"]]

# bios[bios["height_cm"] > 215, ["name", "height_cm"]] #ERR

# bios[(bios["height_cm"] > 215) & (bios["born_country"] == "USA")]
# bios[bios["name"].str.contains("Keith")]
# bios[bios["name"].str.contains("keith | patrick", case=False)]  # same thing as above, else error

bios[
    bios["born_country"].isin(["USA", "FRA", "GBR"])
    & bios["name"].str.startswith("Keith")
].head()

# INFO  - alternate

# bios.query('born_country == "USA"')
bios.query('born_country == "USA" and born_city == "Seattle"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
11030,11088,David Halpern,1955-08-18,Seattle,Washington,USA,United States,178.0,79.0,NaN
12800,12870,Todd Trewin,1958-04-20,Seattle,Washington,USA,United States,180.0,75.0,NaN
15476,15583,Scott McKinley,1968-10-15,Seattle,Washington,USA,United States,183.0,75.0,NaN
29079,29293,Joyce Tanac,1950-09-27,Seattle,Washington,USA,United States,156.0,49.0,NaN
31135,31371,Bill Kuhlemeier,1908-01-14,Seattle,Washington,USA,United States,NaN,NaN,2001-07-08
...,...,...,...,...,...,...,...,...,...,...
133392,136331,Hans Struzyna,1989-03-31,Seattle,Washington,USA,United States,188.0,91.0,NaN
135448,138662,Maude Davis Crossland,2003-03-19,Seattle,Washington,USA,Colombia,NaN,NaN,NaN
136993,140229,Jenell Berhorst,2003-12-13,Seattle,Washington,USA,United States,NaN,NaN,NaN
143507,147159,Nevin Harrison,2002-06-02,Seattle,Washington,USA,United States,175.0,73.0,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN

# Adding/Removing Columns

In [44]:
coffee = pd.read_csv("complete-pandas-tutorial/warmup-data/coffee.csv")

In [41]:
# after rerunning the above block to restart the colm added line

coffee_new = coffee.copy()

coffee_new['price'] = 499 #column added successfully ✅

In [21]:
import numpy as np

coffee_new["new_price"] = np.where(coffee["Coffee Type"] == "Espresso", 399, 499) # SYNTAX if True, then first, else second

coffee_new.head()

         Day Coffee Type  Units Sold  price  new_price
0     Monday    Espresso          25    499        399
1     Monday       Latte          15    499        499
2    Tuesday    Espresso          30    499        399
3    Tuesday       Latte          20    499        499
4  Wednesday    Espresso          35    499        399

In [ ]:
# coffee.drop('price') #ERR
# coffee.drop(columns=["price"]) #INFO returns the new table immediately

# INFO if we wanna change the original table, then
# coffee.drop(columns=['price'], inplace=True)
coffee

# or we could have just done
# coffee_new = coffee_new.drop(columns=["new_price"]) #it won't run again and again as it is already dropped and will give KeyError
# coffee_new

# INFO alternatively
# coffee = coffee[["Day", "Coffee Type"]]  # only the colm needed

In [ ]:
# NOTE RERUN Above import
# coffee['revenue'] = coffee['Units Sold'] * coffee['new_price'] # run just once else erroneous


coffee.rename(columns={'Day':'Days'}) #returns right away, *NOT modify
#NOTE to modify either inplace or reassign
coffee.rename(columns={'Coffee Type':'Coffee'}) # this is the o/p printing, not the og table modified
# coffee

          Day    Coffee  Units Sold
0      Monday  Espresso          25
1      Monday     Latte          15
2     Tuesday  Espresso          30
3     Tuesday     Latte          20
4   Wednesday  Espresso          35
5   Wednesday     Latte          25
6    Thursday  Espresso          40
7    Thursday     Latte          30
8      Friday  Espresso          45
9      Friday     Latte          35
10   Saturday  Espresso          45
11   Saturday     Latte          35
12     Sunday  Espresso          45
13     Sunday     Latte          35